Tekla Open API Reference for Tekla Structures 2025
Detail.DetailType Property
 The detail type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailTypeEnum DetailType { get; set; }
Public Property DetailType As DetailTypeEnum
	Get
	Set
Property Value
Type: DetailTypeEnum
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace